Repository: raetsky-dmitry/rds-ai-excerpt-generator
Catalog: languages/rds-ai-excerpt-*.po
Languages: ru_ru

source: Automatically generate post excerpts using AI based on post content. Requires RDS AI Engine plugin.
ru_ru: Автоматически генерирует отрывки постов с помощью ИИ на основе содержимого. Требуется плагин RDS AI Engine.

source: This plugin requires RDS AI Engine to be installed and activated.
ru_ru: Для работы этого плагина требуется установить и активировать RDS AI Engine.

source: Install RDS AI Engine
ru_ru: Установить RDS AI Engine

source: No AI model selected. Please select a model in
ru_ru: Модель ИИ не выбрана. Пожалуйста, выберите модель в

source: plugin settings
ru_ru: настройках плагина

source: PHP version 7.4 or higher is required. You are running version %s.
ru_ru: Требуется PHP версии 7.4 или выше. У вас установлена версия %s.

source: WordPress version 6.0 or higher is required. You are running version %s.
ru_ru: Требуется WordPress версии 6.0 или выше. У вас установлена версия %s.

source: RDS AI Engine plugin is required. Please install and activate it first.
ru_ru: Требуется плагин RDS AI Engine. Пожалуйста, сначала установите и активируйте его.

source: -- Select Model --
ru_ru: -- Выберите модель --

source: No model selected
ru_ru: Модель не выбрана

source: Plugin Activation Error
ru_ru: Ошибка активации плагина

source: RDS AI Excerpt Generator cannot be activated:
ru_ru: RDS AI Excerpt Generator не может быть активирован:

source: Return to plugins page
ru_ru: Вернуться на страницу плагинов

source: Settings
ru_ru: Настройки

source: AI Excerpt Generator Settings
ru_ru: Настройки AI Excerpt Generator

source: Settings saved successfully!
ru_ru: Настройки успешно сохранены!

source: RDS AI Engine Required
ru_ru: Требуется RDS AI Engine

source: Please install and activate RDS AI Engine plugin first.
ru_ru: Пожалуйста, сначала установите и активируйте плагин RDS AI Engine.

source: Selected Model:
ru_ru: Выбранная модель:

source: Test AI Connection
ru_ru: Тестировать подключение к ИИ

source: Documentation
ru_ru: Документация

source: Show Prompt Variables
ru_ru: Показать переменные промпта

source: Reset to Defaults
ru_ru: Сбросить к значениям по умолчанию

source: System Information
ru_ru: Системная информация

source: Plugin version:
ru_ru: Версия плагина:

source: Available AI Models:
ru_ru: Доступные модели ИИ:

source: No models found
ru_ru: Модели не найдены

source: Log directory:
ru_ru: Каталог логов:

source: Not found
ru_ru: Не найден

source: PHP version:
ru_ru: Версия PHP:

source: WordPress version:
ru_ru: Версия WordPress:

source: Available Prompt Variables
ru_ru: Доступные переменные промпта

source: Important:
ru_ru: Важно:

source: The <code>{{content}}</code> variable is <strong>REQUIRED</strong>. It will be replaced with the actual post content.
ru_ru: Переменная <code>{{content}}</code> <strong>ОБЯЗАТЕЛЬНА</strong>. Она будет заменена фактическим содержимым поста.

source: Other variables are optional.
ru_ru: Остальные переменные необязательны.

source: Variable
ru_ru: Переменная

source: Description
ru_ru: Описание

source: Required
ru_ru: Обязательно

source: The post content to summarize
ru_ru: Содержимое поста

source: YES
ru_ru: ДА

source: The post title
ru_ru: Заголовок поста

source: No
ru_ru: Нет

source: Writing style (descriptive, advertising, business, creative)
ru_ru: Стиль письма (описательный, рекламный, деловой, творческий)

source: Tone (neutral, formal, friendly, professional)
ru_ru: Тон (нейтральный, формальный, дружелюбный, профессиональный)

source: Language code (en, ru, es, fr, de, etc.)
ru_ru: Код языка (en, ru, es, fr, de и т.д.)

source: Maximum length in words (e.g., 150)
ru_ru: Максимальная длина в словах (например, 150)

source: Keywords to focus on (comma-separated)
ru_ru: Ключевые слова для акцента (через запятую)

source: Example Prompts
ru_ru: Примеры промптов

source: Basic Example:
ru_ru: Базовый пример:

source: Detailed Example:
ru_ru: Подробный пример:

source: Close
ru_ru: Закрыть

source: Select the AI model to use for excerpt generation.
ru_ru: Выберите модель ИИ для генерации отрывков.

source: Set default values for excerpt generation.
ru_ru: Установите значения по умолчанию для генерации отрывков.

source: Select which post types should have the AI Excerpt Generator available.
ru_ru: Выберите типы записей, для которых должен быть доступен AI Excerpt Generator

source: Configure security settings and limits.
ru_ru: Настройте параметры безопасности и ограничения.

source: Debug and logging settings.
ru_ru: Настройки отладки и логирования.

source: Select AI Model
ru_ru: Выберите модель ИИ

source: No AI models found. Please check RDS AI Engine plugin configuration.
ru_ru: Модели ИИ не найдены. Пожалуйста, проверьте конфигурацию плагина RDS AI Engine.

source: Select an AI model from RDS AI Engine plugin.
ru_ru: Выберите модель ИИ из плагина RDS AI Engine.

source: Default Style
ru_ru: Стиль по умолчанию

source: Descriptive
ru_ru: Описательный

source: Advertising
ru_ru: Рекламный

source: Business
ru_ru: Деловой

source: Creative
ru_ru: Творческий

source: Default Tone
ru_ru: Тон по умолчанию

source: Neutral
ru_ru: Нейтральный

source: Formal
ru_ru: Формальный

source: Friendly
ru_ru: Дружелюбный

source: Professional
ru_ru: Профессиональный

source: Default Max Length (words)
ru_ru: Макс. длина по умолчанию (слов)

source: Maximum length of generated excerpt in words
ru_ru: Максимальная длина сгенерированного отрывка в словах

source: Default Focus Keywords
ru_ru: Ключевые слова по умолчанию

source: Default focus keywords (comma-separated)
ru_ru: Ключевые слова по умолчанию (через запятую)

source: System Prompt
ru_ru: Системный промпт

source: Enter your system prompt here...
ru_ru: Введите ваш системный промпт здесь...

source: Prompt Variables
ru_ru: Переменные промпта

source: REQUIRED
ru_ru: ОБЯЗАТЕЛЬНО

source: Writing style (descriptive, advertising, etc.)
ru_ru: Стиль письма (описательный, рекламный и т.д.)

source: Tone (neutral, formal, friendly, etc.)
ru_ru: Тон (нейтральный, формальный, дружелюбный и т.д.)

source: Language code (en, ru, es, etc.)
ru_ru: Код языка (en, ru, es и т.д.)

source: Maximum length in words
ru_ru: Максимальная длина в словах

source: Keywords to focus on
ru_ru: Ключевые слова для акцента

source: You must include <code>{{content}}</code> variable in your prompt where you want the post content to appear.
ru_ru: Вы должны включить переменную <code>{{content}}</code> в ваш промпт там, где должно появиться содержимое поста.

source: The content will NOT be added automatically.
ru_ru: Содержимое НЕ будет добавлено автоматически.

source: Enabled Post Types
ru_ru: Разрешенные типы записей

source: Select post types where AI Excerpt Generator should be available.
ru_ru: Выберите типы записей, для которых должен быть доступен AI Excerpt Generator.

source: Max Content Length (characters)
ru_ru: Макс. длина содержимого (символов)

source: Maximum characters to send to AI (to manage token usage)
ru_ru: Максимальное количество символов для отправки ИИ (для управления использованием токенов)

source: Allowed User Roles
ru_ru: Разрешенные роли пользователей

source: User roles allowed to use the AI Excerpt Generator
ru_ru: Роли пользователей, которым разрешено использовать AI Excerpt Generator

source: Enable Debug Logging
ru_ru: Включить логирование отладки

source: Enable debug logging to file
ru_ru: Включить логирование отладки в файл

source: Logs are saved to: %s
ru_ru: Логи сохраняются в: %s

source: Security check failed.
ru_ru: Проверка безопасности не пройдена.

source: Insufficient permissions.
ru_ru: Недостаточно прав.

source: Invalid post ID.
ru_ru: Неверный ID записи.

source: Post not found.
ru_ru: Запись не найдена.

source: No model selected.
ru_ru: Модель не выбрана.

source: AI connection successful!
ru_ru: Подключение к ИИ успешно!

source: RDS AI Engine is not available. Please install and activate the RDS AI Engine plugin.
ru_ru: RDS AI Engine недоступен. Пожалуйста, установите и активируйте плагин RDS AI Engine.

source: No AI model selected. Please select a model in plugin settings.
ru_ru: Модель ИИ не выбрана. Пожалуйста, выберите модель в настройках плагина.

source: The {{content}} variable is missing from your system prompt. Please include it to send the post content to AI.
ru_ru: В вашем системном промпте отсутствует переменная {{content}}. Пожалуйста, включите ее для отправки содержимого поста ИИ.

source: AI Engine chat method not found.
ru_ru: Метод чата AI Engine не найден.

source: RDS AI Engine is not available.
ru_ru: RDS AI Engine недоступен.

source: No model selected for testing.
ru_ru: Модель для тестирования не выбрана.

source: Received empty response from AI Engine.
ru_ru: Получен пустой ответ от AI Engine.

source: Connection test failed: %s
ru_ru: Тест подключения не удался: %s

source: Unknown Model
ru_ru: Неизвестная модель

source: Invalid Model
ru_ru: Неверная модель

source: Model not found
ru_ru: Модель не найдена

source: Generating excerpt...
ru_ru: Генерация отрывка...

source: Excerpt generated successfully!
ru_ru: Отрывок успешно сгенерирован!

source: Excerpt applied successfully!
ru_ru: Отрывок успешно применен!

source: Copied to clipboard!
ru_ru: Скопировано в буфер обмена!

source: Error:
ru_ru: Ошибка:

source: Style:
ru_ru: Стиль:

source: Tone:
ru_ru: Тон:

source: Language:
ru_ru: Язык:

source: Focus Keywords (comma-separated):
ru_ru: Макс. длина (слов):

source: Generate Excerpt
ru_ru: Сгенерировать отрывок

source: Generated Excerpt:
ru_ru: Сгенерированный отрывок:

source: Apply to Excerpt
ru_ru: Применить

source: Copy
ru_ru: Копировать

source: Focus Keywords:
ru_ru: Ключевые слова для акцента

source: Current Excerpt:
ru_ru: Текущий отрывок

source: No excerpt to apply.
ru_ru: Нет отрывка для применения.

source: Failed to apply excerpt to post.
ru_ru: Не удалось применить отрывок к записи.

source: No excerpt to copy.
ru_ru: Нет отрывка для копирования.

source: Failed to copy to clipboard.
ru_ru: Не удалось скопировать в буфер обмена.

source: Unknown error occurred.
ru_ru: Произошла неизвестная ошибка.

source: Failed to generate excerpt. Please try again.
ru_ru: Не удалось сгенерировать отрывок. Пожалуйста, попробуйте снова.

source: Testing...
ru_ru: Тестирование...

source: Connection successful!
ru_ru: Подключение успешно!

source: Connection failed.
ru_ru: Подключение не удалось.

source: Error
ru_ru: Ошибка

source: Please select a model first.
ru_ru: Пожалуйста, сначала выберите модель.

source: Are you sure you want to reset all settings to defaults?
ru_ru: Вы уверены, что хотите сбросить все настройки к значениям по умолчанию?

source: Settings reset successfully.
ru_ru: Настройки успешно сброшены.
